-- Заполнение данными
INSERT INTO direction VALUES
('09.03.01', 'Информатика и вычислительная техника'),
('09.03.02', 'Информационные системы и технологии'),
('09.03.04', 'Программная инженерия'),
('10.03.01', 'Информационная безопасность'),
('12.03.01', 'Приборостроение'),
('16.03.01', 'Техническая физика'),
('27.03.03', 'Системный анализ и управление');


INSERT INTO course VALUES
('Информатика'),
('Компьютерная графика'),
('Основы программирования'),
('Математический анализ'),
('Линейная алгебра'),
('Дискретная математика'),
('Физика');


INSERT INTO building VALUES
('4-я линия ВО, 54'),
('Каменноостровский пр., 86'),
('Московский пр., 3'),
('Невский пр., 39');


INSERT INTO teacher VALUES
('0185729', 'Смирнова Екатерина Романовна', 'Профессор'),
('0987654', 'Петров Петр Петрович', 'Старший преподаватель'),
('1234567', 'Иванов Иван Иванович', 'Преподаватель'),
('2950157', 'Иванова Мария Ивановна', 'Доцент'),
('3905724', 'Сидорова Варвара Павловна', 'Старший преподаватель'),
('4561237', 'Васильев Василий Васильевич', 'Доцент'),
('7863450', 'Александров Александр Александрович', 'Преподаватель'),
('7982341', 'Андреев Андрей Андреевич', 'Профессор');


INSERT INTO department VALUES
(1, 'Управление'),
(2, 'Физика'),
(3, 'Кибербезопасность'),
(4, 'Программирование');


INSERT INTO classroom VALUES
('12-01', '4-я линия ВО, 54'),
('31-06', '4-я линия ВО, 54'),
('12-43б', '4-я линия ВО, 54'),
('1', 'Каменноостровский пр., 86'),
('42', 'Каменноостровский пр., 86'),
('29', 'Каменноостровский пр., 86'),
('345', 'Московский пр., 3'),
('213', 'Московский пр., 3'),
('112', 'Московский пр., 3'),
('11-43а', 'Невский пр., 39'),
('24-92', 'Невский пр., 39'),
('13-02', 'Невский пр., 39');


INSERT INTO teacher_department VALUES
(1, '0185729'),
(1, '7863450'),
(2, '0987654'),
(2, '3905724'),
(2, '4561237'),
(3, '1234567'),
(3, '2950157'),
(4, '2950157'),
(4, '7982341');


INSERT INTO direction_department VALUES
('09.03.01', 4),
('09.03.02', 4),
('09.03.04', 4),
('10.03.01', 3),
('16.03.01', 2),
('12.03.01', 1),
('27.03.03', 1);


INSERT INTO stream VALUES
(2024, '09.03.01'),
(2023, '09.03.01'),
(2024, '09.03.02'),
(2023, '09.03.04'),
(2022, '10.03.01'),
(2022, '12.03.01'),
(2024, '16.03.01'),
(2023, '16.03.01'),
(2023, '27.03.03');


INSERT INTO group_tb VALUES
('41', 1, '09.03.01', 2024),
('40', 3, '09.03.01', 2023),
('42', 1, '09.03.02', 2024),
('44', 3, '09.03.04', 2023),
('11', 5, '10.03.01', 2022),
('10', 5, '12.03.01', 2022),
('20', 1, '16.03.01', 2024),
('21', 1, '16.03.01', 2024),
('22', 3, '16.03.01', 2023),
('12', 3, '27.03.03', 2023),
('13', 3, '27.03.03', 2023);


INSERT INTO term_stream_by_course VALUES
(1, 34, 30, 'Экзамен', '09.03.01', 2024, 'Информатика'),
(1, 34, 30, 'Зачет', '09.03.04', 2023, 'Информатика'),
(1, 30, 28, 'Экзамен', '12.03.01', 2022, 'Линейная алгебра'),
(1, 56, 46, 'Экзамен', '16.03.01', 2024, 'Физика'),
(1, 40, 34, 'Диф.зачет', '27.03.03', 2023, 'Основы программирования'),
(2, 44, 36, 'Зачет', '09.03.01', 2024, 'Информатика'),
(2, 54, 48, 'Экзамен', '09.03.02', 2024, 'Математический анализ'),
(2, 34, 40, 'Экзамен', '10.03.01', 2022, 'Дискретная математика'),
(3, 42, 38, 'Экзамен', '09.03.01', 2023, 'Компьютерная графика'),
(3, 54, 48, 'Экзамен', '09.03.02', 2024, 'Информатика'),
(4, 44, 40, 'Экзамен', '16.03.01', 2023, 'Информатика');


INSERT INTO class VALUES
('Понедельник', 2, 'Нечетная', '12-01', '4-я линия ВО, 54', 'Информатика', '2950157'),
('Понедельник', 3, 'Нечетная', '42', 'Каменноостровский пр., 86', 'Математический анализ', '0987654'),
('Вторник', 1, 'Четная', '1', 'Каменноостровский пр., 86', 'Математический анализ', '0987654'),
('Вторник', 4, 'Нечетная', '345', 'Московский пр., 3', 'Физика', '1234567'),
('Вторник', 6, 'Четная', '112', 'Московский пр., 3', 'Дискретная математика', '7863450'),
('Среда', 2, 'Четная', '29', 'Каменноостровский пр., 86', 'Линейная алгебра', '0185729'),
('Среда', 3, 'Нечетная', '31-06', '4-я линия ВО, 54', 'Компьютерная графика', '7982341'),
('Среда', 5, 'Нечетная', '24-92', 'Невский пр., 39', 'Основы программирования', '2950157'),
('Четверг', 3, 'Четная', '31-06', '4-я линия ВО, 54', 'Информатика', '3905724'),
('Четверг', 4, 'Нечетная', '12-43б', '4-я линия ВО, 54', 'Компьютерная графика', '7982341'),
('Четверг', 7, 'Четная', '13-02', 'Невский пр., 39', 'Информатика', '2950157'),
('Пятница', 1, 'Нечетная', '213', 'Московский пр., 3', 'Линейная алгебра', '4561237'),
('Пятница', 2, 'Четная', '13-02', 'Невский пр., 39', 'Физика', '1234567'),
('Суббота', 2, 'Четная', '213', 'Московский пр., 3', 'Основы программирования', '7863450'),
('Суббота', 3, 'Нечетная', '13-02', 'Невский пр., 39', 'Математический анализ', '4561237'),
('Суббота', 5, 'Нечетная', '29', 'Каменноостровский пр., 86', 'Информатика', '3905724');


INSERT INTO group_class VALUES
('10', 'Суббота', 3, 'Нечетная', '13-02', 'Невский пр., 39'),
('11', 'Вторник', 6, 'Четная', '112', 'Московский пр., 3'),
('11', 'Суббота', 3, 'Нечетная', '13-02', 'Невский пр., 39'),
('12', 'Пятница', 1, 'Нечетная', '213', 'Московский пр., 3'),
('13', 'Пятница', 1, 'Нечетная', '213', 'Московский пр., 3'),
('20', 'Вторник', 4, 'Нечетная', '345', 'Московский пр., 3'),
('20', 'Четверг', 7, 'Четная', '13-02', 'Невский пр., 39'),
('21', 'Вторник', 4, 'Нечетная', '345', 'Московский пр., 3'),
('21', 'Четверг', 3, 'Четная', '31-06', '4-я линия ВО, 54'),
('22', 'Пятница', 2, 'Четная', '13-02', 'Невский пр., 39'),
('40', 'Среда', 3, 'Нечетная', '31-06', '4-я линия ВО, 54'),
('41', 'Вторник', 1, 'Четная', '1', 'Каменноостровский пр., 86'),
('41', 'Понедельник', 2, 'Нечетная', '12-01', '4-я линия ВО, 54'),
('41', 'Среда', 2, 'Четная', '29', 'Каменноостровский пр., 86'),
('41', 'Суббота', 5, 'Нечетная', '29', 'Каменноостровский пр., 86'),
('42', 'Вторник', 1, 'Четная', '1', 'Каменноостровский пр., 86'),
('42', 'Понедельник', 3, 'Нечетная', '42', 'Каменноостровский пр., 86'),
('42', 'Среда', 5, 'Нечетная', '24-92', 'Невский пр., 39'),
('44', 'Суббота', 2, 'Четная', '213', 'Московский пр., 3'),
('44', 'Четверг', 4, 'Нечетная', '12-43б', '4-я линия ВО, 54');